## Proyecto 2 Aws con Python y MySql
### Edward Tohom
### Carné 26430042

### Lectura de datos desde Python a BD

In [8]:
import pandas as pd
import numpy as no
import configparser

In [9]:
config = configparser.ConfigParser()
config.read('escec.cfg')

['escec.cfg']

In [10]:
RDS_HOST = 'banco.chsado2c29rj.us-east-1.rds.amazonaws.com'

In [11]:
postgres_driver = f"""postgresql://{config.get('RDS', 'DB_USER')}:{config.get('RDS', 'DB_PASSWORD')}@{RDS_HOST}:{config.get('RDS', 'DB_PORT')}/{config.get('RDS', 'DB_NAME')}"""

### Creamos dimensión de Centros

In [13]:
sql_query = 'SELECT * FROM "CENTROS";'
df_centros = pd.read_sql(sql_query, postgres_driver)
df_centros.head()

   NUMCE                  NOMCE                   DIRCE
0   10.0           SEDE CENTRAL  C/ ATOCHA, 820, MADRID
1   20.0  RELACIÓN CON CLIENTES  C/ ATOCHA, 405, MADRID

### Creamos dimensión de Empleados

In [14]:
sql_query = 'SELECT * FROM "EMPLEADOS";'
df_empleados = pd.read_sql(sql_query, postgres_driver)
df_empleados.head()

   NUMEM  EXTEL     FECNA     FECIN  SALAR COMIS  NUMHI    NOMEM  NUMDE
0    110    350  19701011  19850215   1800  NULL      3    CESAR    121
1    120    840  19680906  19880110   1900   110      1    MARIO    112
2    130    810  19650909  19810102   1500   110      2  LUCIANO    112
3    150    340  19721008  19970115   2600  NULL      0    JULIO    121
4    160    740  19800907  20051111   1800   110      2    AUREO    111

### Creamos dimensión de Departamentos

In [15]:
sql_query = 'SELECT * FROM "DEPARTAMENTOS";'
df_departamentos = pd.read_sql(sql_query, postgres_driver)
df_departamentos.head()

   NUMDE  NUMCE  DIRCEC TIDIR  PRESU DEPDE              NOMDE
0    100     10     260     P     72  NULL  DIRECCIÓN GENERAL
1    110     20     180     P     90   100   DIRECC.COMERCIAL
2    111     20     180     F     66   110  SECTOR INDUSTRIAL
3    112     20     270     P     54   110   SECTOR SERVICIOS
4    120     10     150     F     18   100       ORGANIZACIÓN